[
{"date": "\n        2/21/2018\n    ", "rating": "5.0 star rating", "review": "All you can eat hotpot, great to go with group and enjoy a social meal."},
{"date": "\n        2/6/2018\n    ", "rating": "4.0 star rating", "review": "I love this place.  It's not somewhere I go frequently, but it has turned into a bit of a special occasion place for friends.  It's not fancy, and it's about $20 for all you can eat hot pot.  They have an extensive selection of meats, veggies, seafood, and tofu to choose from, and it's not difficult to order vegetarian or vegan.  The sauce bar is amazing, too."},
{"date": "\n        1/30/2018\n            ", "rating": "5.0 star rating", "review": "Love this place. I don't live downtown but it's worth the drive down or suggestions way down. All you can eat is worth it. Great selection and you can get individual pots. What's even better? They have a sauce station and even get unlimited eggs! Eat until you explode. Beef and lamb slices were so good. I'm drooling thinking about my experience!"},
{"date": "\n        1/7/2018\n    ", "rating": "2.0 star rating", "review": "Came here for dinner on a friday night at 6pm with a larger group of 6. It was still fairly empty but by the time we left at 8.30 the place was definitely filled up. I was really worried about coming here with the less than desirable reviews from others about cleanness, but I thought it was ok didn't seem as bad as others made me think it would be. "},
{"date": "\n        12/30/2017\n    ", "rating": "1.0 star rating", "review": "DON'T EVEN BOTHER. AVOID THIS PLACE, IT IS JUST PLAIN DISGUSTING AND NOT VERY CLEAN AT ALL."},
{"date": "\n        12/28/2017\n    ", "rating": "1.0 star rating", "review": "AVOID AT ALL COST"},
{"date": "\n        12/20/2017\n    ", "rating": "5.0 star rating", "review": "My absolute favourite Hotpot restaurant in the whole GTA area!"},
{"date": "\n        12/16/2017\n    ", "rating": "5.0 star rating", "review": "An abundance of vegetarian and vegan options!! Hotpot to me screams meat-based broths, raw meat slices, fish balls etc, so I was so pleasantly surprised to see at least 3 vegetarian/vegan broths (we all had the veggie and tofu broth which is 1/2 that has no additional $3 charge, but other veg options include wintermelon, Chinese herbs) and a huge list of fresh veggies (from taro to fresh spinach to lotus root) and lots of tofu (silky, frozen, curds). There's also an abundance of meat and seafood options obviously, and everything was nicely thinly sliced and so fresh looking. Tip- don't go crazy with ordering because portion sizes are huge especially for veggies, so order 1 per 2-3 people then order more if you have to later to reduce food waste (I don't think they penalize/fine you for leftovers if you leave them undisturbed). Unlimited sauce and beverage (sweetened soy milk, plum juice, honey green tea) refills. Each person can get their own pot and stove top. "},
{"date": "\n        12/13/2017\n    ", "rating": "4.0 star rating", "review": "Had a tremendously filling meal here with a friend that comes regularly. I had never been to a hot pot before, and he's an expert on these kinds of things - I love finding new restaurants where I can get a lot of yummy vegetarian food, so he's been helping me find new ones that had flown under my radar."},
{"date": "\n        12/1/2017\n    ", "rating": "4.0 star rating", "review": "A friend brought me here, this is his go to place for hotpot and I was so happy. I've been to two other hotpot places and they weren't as great. This place wasn't stingy with their all you could eat. The place was super clean and soup base was delicious. The service was great too! "},
{"date": "\n        11/22/2017\n    ", "rating": "1.0 star rating", "review": "Terrible service. Only one server during lunch hour. Asking to get a refil for my coke took no less than half an hour. Absolutely terrible service!"},
{"date": "\n        11/20/2017\n    ", "rating": "5.0 star rating", "review": "This place is great! I come here all the time and I brought my family once, it's great for family dinners or get togethers."},
{"date": "\n        11/19/2017\n    ", "rating": "5.0 star rating", "review": "Had hotpot here with my friends couple days ago. I am glad they all like it!"},
{"date": "\n        11/19/2017\n    ", "rating": "5.0 star rating", "review": "We come here on the regular. They have the best spicy broth and really friendly staff. The manager is super great, he makes sure we always have a great experience. Would highly recommend, it's a must try!"},
{"date": "\n        11/18/2017\n    ", "rating": "1.0 star rating", "review": "I would not go back or recommend. You will have much better experience going with another hot pot place in Chinatown. Morals, Mongolian and chine are better in terms of service and food. Overall, the people are hard working but I would rather cook at home."},
{"date": "\n        11/16/2017\n    ", "rating": "1.0 star rating", "review": "their service is tooo bad"},
{"date": "\n        11/1/2017\n    ", "rating": "3.0 star rating", "review": "Good value and selection of food for individual hot pot experience. Service is okay, but for Chinatown and what you pay, I'm a fan and the 10% off offer when you check in on Yelp is always a bonus."},
{"date": "\n        10/1/2017\n    ", "rating": "1.0 star rating", "review": "I will never come back to this restaurant. "},
{"date": "\n        9/30/2017\n    ", "rating": "5.0 star rating", "review": "My first hot pot experience.  For $22 they give you like 20 different meets, vegetables, noodles and more.  We couldn't finish all the food.  The food and service was outstanding."},
{"date": "\n        9/27/2017\n    ", "rating": "1.0 star rating", "review": "Tips is including your bill. Be careful to pay double tips, they don't mention the bill is included tips. I don't recommend this place."}
]