[
{"date": "11 March 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Great place for family and friends. The all you can eat option gives you plenty of food to cook and enjoy. Very reasonably priced."},
{"date": "10 February 2018", "rating": "ui_bubble_rating bubble_10", "title": null, "review": "We went here thinking it was one price all you can eat. Posted price was 23.50 each but after all the extra add ones and a mandadated 10% tip for two we spent over $80 for them to bring us uncooked food and soup to..."},
{"date": "20 August 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Visited Toronto in July 2017 and made a trip to Chinatown for dinner a couple of nights. One of the nights ended up with us eating dinner at the Celebrity Hot Pot restaurant. I believe it was about $18.99 CAD for the all you can..."},
{"date": "6 August 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Went for Hot Pot at the Celebrity Hot Pot restaurant, on a Wednesday night, reservations are recommended, but the place wasn't very busy the day we went. My son has been there many times, so he ordered for us, and it was very good. Nothing..."},
{"date": "5 August 2017", "rating": "ui_bubble_rating bubble_10", "title": null, "review": "We walked in, no sign saying whether or not to be seated, so we took a booth. Can't tell you alot about the food because no one ever came to give us a menu or take our order. Did not seem to be anyone working...."},
{"date": "13 March 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "It was very fun to sit and cook food in whatever order you wanted to eat it in. The fish was lovely, the meat and chicken was very tender, portions were good, the broth to cook it all in was VERY good - most at..."},
{"date": "9 March 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "This is comfort food Asian style. I was a little overwhelmed with the menu but Dat came over, explained how hot pot works and ordered the first round of food. His selection brought something from everything on the menu. You get various noodles, veggies, fish..."},
{"date": "13 February 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "A bunch of my coworkers and I (13 people in total) came here after work on a frigid winter night a couple of weeks ago. I've never been to this restaurant before but I hotpot on a regular basis so I know good hotpot and..."},
{"date": "20 December 2016", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "I went to the Celebrity Hotpot with two exchange students from China and they loved the meal and so did the rest of the family. The staff helped the students bridge food words between languages and we all enjoyed Chinese food that isn't just the..."},
{"date": "15 November 2016", "rating": "ui_bubble_rating bubble_20", "title": null, "review": "We arrived late evening with a few tables empty at the front but after being looked up and down we were seated at a back table with only half the hot plates functional, next to a table of garbage being used by the staff. No..."}
]