[
{"date": "\n        1/26/2018\n    ", "rating": "4.0 star rating", "review": "Quite a chill place. The ambience is nice and full of beautiful Asian people. The food is good as well but I find it more of a drinking place. Lots of sake selections. "},
{"date": "\n        1/11/2018\n    ", "rating": "3.0 star rating", "review": "The first to arrive was the Spicy Sashimi Salad.  This had diced sashimi and greens with a sweet-chili dressing.  While I found the greens to be very fresh in this salad, I didn't think that it was overall that spectacular.  But then again, it's really just sashimi salad so unless there was something really extra about it, it was mediocre."},
{"date": "\n        1/1/2018\n    ", "rating": "4.0 star rating", "review": "First time trying Hashi Izakaya - I must have walked past this place for years. It's actually a lot bigger inside than I anticipated and quite cozy! Prices are on the more expensive side, but it is an izakaya after all. Between four friends, we ordered 5 dishes and ended up paying about $20 each after taxes and tip so in the end, it wasn't too bad! Here's one of my favourite dishes I tried: the salmon rice don ($15). A nice blend of fish roe, rice, veggies, beets amongst the salmon sashimi. Very delicious & nutritious - I'd recommend it!"},
{"date": "\n        12/16/2017\n    ", "rating": "4.0 star rating", "review": "This place can be described as like a cross between a bar and a sort of sushi restaurants with the way they have more hidden away seating off to the side (like booths but not really). "},
{"date": "\n        9/12/2017\n    ", "rating": "3.0 star rating", "review": "Food is good but expensive. Portion is so small that I was still hungry even after paying $100+ for two people and that is without ordering drinks!"},
{"date": "\n        8/13/2017\n    ", "rating": "5.0 star rating", "review": "Just get the nine dish platter thing. Don't think. Just do it. So extra. Yas."},
{"date": "\n        8/9/2017\n    ", "rating": "5.0 star rating", "review": "There aren't enough good Izakayas in Toronto but thankfully Hashi exists! Great selection of beer, open late, convenient parking, and the food is delicious. "},
{"date": "\n        8/1/2017\n    ", "rating": "3.0 star rating", "review": "I ate a beef don meal set and a Oden ."},
{"date": "\n        4/14/2017\n            ", "rating": "1.0 star rating", "review": "I am quite disappointed at the changes made to this place. I gave it a couple of chances since their recent change, tried their regular menu as well as their set menu, but it just wasn't up to par.  I'm not sure if the owner or chef has changed, but they seem to have \"cheaped out\" on the food quality and quantity.  My previous review indicated that this place was great BECAUSE of their consistency, but even the service was worse this time around!"},
{"date": "\n        4/12/2017\n    ", "rating": "4.0 star rating", "review": "I've ordered the Tako wasa, the seafood was a bit blend. The Ebi curry -mayo was flavourful. The aburi hako sushi-salmon, crispy shrimp, spicy mayo is a good combination in terms of flavour. I've always enjoyed the ODEN-bonito base broth with fish cakes, egg, daikon. This is perfect for winter with the spicy soup and different variety of fish balls."},
{"date": "\n        4/6/2017\n    ", "rating": "1.0 star rating", "review": "Terrible food quality! Especially the Oyster with Cheese, only tiny tiny piece on each oyster shell, and the shell looks like reuse due to the outside didn't keep any original color, even after BBQ, you can still see some black or grey color, but the whole thing is white. Disgusting!"},
{"date": "\n        3/19/2017\n    ", "rating": "4.0 star rating", "review": "A cozy izakaya which is good for dinner or just for a drink. Has a nice sake list where you can explore & sometimes the special are really good"},
{"date": "\n        3/14/2017\n    ", "rating": "4.0 star rating", "review": "Prices at this Izakaya are not cheap. If you want a value-for-money item here, I would recommend their SALMON IKURA DON; portion is huge, sashimi is fresh, and it looks pretty.  "},
{"date": "\n        3/10/2017\n    ", "rating": "4.0 star rating", "review": "I think people forget that Hashi is an izakaya, meaning that food portions will be small. This is why I never come here with the intention of eating a full meal. "},
{"date": "\n        3/7/2017\n    ", "rating": "3.0 star rating", "review": "Relatively small portions size so do that expect to be full unless you are willing to order a lot. The food itself was okay; the pork belly was mostly fat and the quail so dry we could see the individual fibers. The dish I do recommend is the seafood udon, that was absolutely delicious and I would come back just for it."},
{"date": "\n        3/5/2017\n    ", "rating": "4.0 star rating", "review": "The food is simply delicious! Waitstaff are friendly too. Even though they jacked up the prices a lot, I may still come back if I'm in the area."},
{"date": "\n        3/5/2017\n    ", "rating": "4.0 star rating", "review": "I enjoyed my time here at Hashi. Servers were really friendly and provided great customer service. We came as a party of 3. Ordered the Hashi Don, Grilled Octopus, daily special of sushi (ebi, ice fish, uni), Torched Salmon Sushi & Hashi Chanpon Ramen. Food presentation was great. Interior was great with good music. Really meant for gatherings and drinking as well. Definitely coming here again!"},
{"date": "\n        1/4/2017\n    ", "rating": "4.0 star rating", "review": "Came with the guys for a night out."},
{"date": "\n        12/27/2016\n    ", "rating": "3.0 star rating", "review": "good place to drink...affordable pitchers...but food left a lot to be desired"},
{"date": "\n        11/11/2016\n    ", "rating": "4.0 star rating", "review": "Visited Fri Oct 7 for dinner "}
]