[{"date": "27 January 2018", "rating": "ui_bubble_rating bubble_40", "review": "Looking for a place for a snack after a movie. It is a very fun place and the staff are friendly and helpful. A bit noisy though. Good selections of snacks and food that can be shared, as we did with our group. Fast service...", "title": null},
{"date": "13 December 2017", "rating": "ui_bubble_rating bubble_50", "review": "We had a small gathering for a friend moving overseas. Once again, we chose Kinka because of its great food and loud and fun atmosphere.\nUsually, I chose fish. Either sashimi or their tasty black cod.\nThis time, we decided to go for prix fixe...", "title": null},
{"date": "26 August 2017", "rating": "ui_bubble_rating bubble_20", "review": "Out for lunch with my daughter -- she suggested going here. Had to ask for water. Throughout the meal, whenever I asked for anything (several times), I was always ignored when the server returned. They always deferred to my daughter, as if I didn't exist....", "title": null},
{"date": "18 August 2017", "rating": "ui_bubble_rating bubble_40", "review": "I went there multiple times and the food was great every time. The staff is friendly and the service is very quick. I would recommend to try the weekly specials.", "title": null},
{"date": "10 July 2017", "rating": "ui_bubble_rating bubble_50", "review": "the best Japanese izakaya in North York probably in GTA area.\nmust order: tako wasabi, fried chicken and beef ribs", "title": null},
{"date": "25 June 2017", "rating": "ui_bubble_rating bubble_40", "review": "For a celebratory get-together, we met at Kinka Izakaya and had a good time at lunch on Sun. Brie cheese was tasty deep-fried, and the twist on sizzling Korean rice-bowl was savoury (but not enough vegetables). The ramen noodle was okay. I think the mackerel...", "title": null},
{"date": "18 May 2017", "rating": "ui_bubble_rating bubble_50", "review": "Went to this restaurant with my daughter and her friend when I visited Toronto in April.\nThe staff were very engaged and friendly, shouting a cheery welcome to guests as we arrived. The food was great, very generous servings and nicely presented. What won us...", "title": null},
{"date": "20 April 2017", "rating": "ui_bubble_rating bubble_50", "review": "A friend who lives in Toronto recommended this restaurant to us as their Saba Oshizushi (blowtorched seared pressed mackerel sushi) was something to die for. She wasn't wrong.\nWe went for lunch and the restaurant was quiet - you get greeted but staff yelling 'Irasshaimase!'...", "title": null},
{"date": "19 April 2017", "rating": "ui_bubble_rating bubble_40", "review": "This is the perfect type of restaurant for anyone who enjoys variety. Everything is portioned to sample size so you don't feel like you can't order more things to try. Pricing is reasonable as well.\nHowever, if you are someone who enjoys quiet conversations over...", "title": null},
{"date": "4 April 2017", "rating": "ui_bubble_rating bubble_50", "review": "Well laid out and aesthetically quite pleasing. Atmosphere is warm and alive as staff greet and bid farewell to all patrons. The menu was full of tempting options. Ordered about 8 dishes, including dessert, and would eagerly enjoy them again. Exceeded expectations.", "title": null}]