[
{"date": "\n        3/20/2018\n    ", "rating": "5.0 star rating", "review": "Best fluffy Japanese cheesecake I've ever had. This place is totally lives up to all the hype. These cakes go out the door quick and taste best fresh so you better wait in line if you want to snag one. The cakes are amazingly soft and rich, I can't wait for one to open up in my hometown: Vancouver!"},
{"date": "\n        3/8/2018\n    ", "rating": "3.0 star rating", "review": "Decided to try this place out from all the hype. My boyfriend and I stopped by on a Wednesday around 5pm and there was no line. The shop is divided into two mini shops with separate entrances. One side sells the infamous Japanese cheesecakes (which are $10 each) and the other side sells cheesecake tarts (which are $3.50 each). We bought one cheesecake and two tarts (matcha and cheese). The tarts were quite delicious! I preferred the matcha one as the cheese one was quite cheesy. The cheesecake was alright. I've never had Japanese cheesecake before, so I didn't know what to expect. The texture and flavour are very light. I almost feel like it would be better with some sauce, like a strawberry or blueberry sauce. I'm glad I tried it, but I won't be running back for more."},
{"date": "\n        3/5/2018\n    ", "rating": "2.0 star rating", "review": "When I eat cheesecake I'm not satisfied til it sits in my stomach like a stone, filling me equally with milk products and regret, displacing any physical forward momentum - this airy fairy thing feels like some sort spray-can-esque instant cake"},
{"date": "\n        2/25/2018\n    ", "rating": "4.0 star rating", "review": "Such fluffiness... I like how Japanese cheesecakes are much lighter and less sweet than the typical American cheesecake, and Uncle Tetsu's ~CA$10 Original 6 inch Japanese Cheesecake is on point with all of that. I hear that the wait times and lines for these cheesecakes can get pretty long, and I personally don't believe they're worth waiting more than 15 minutes for, but these yummy clouds of delightfulness are definitely worth the money and a wonderful way to brighten up your day! Mmm."},
{"date": "\n        2/16/2018\n    ", "rating": "5.0 star rating", "review": "This is some of the best cheesecake I've ever had in my life. This is the famous Julie cheesecake from Japan that everyone raves about. My husband got us some from downtown and we were both blown away. We love how it's not super sweet and how it is so soft and light. It is delicious and we will definitely be back next time to get some more. Delicious delicious delicious"},
{"date": "\n        2/15/2018\n    ", "rating": "5.0 star rating", "review": "I'm glad there was no line when I went (a Thursday around 2 or 3), bc I was determined not to wait in a huge line up just for cheesecake. I don't even really like cheesecake! "},
{"date": "\n        2/11/2018\n    ", "rating": "4.0 star rating", "review": "I often walk by here, but I never buy the cheese cake because I always see long line up, don't wanna wait. Well i already try it before in Asia. After 2 years since it opened, I finally walk in here and try because there wasn't any line up on a Friday night around 9:45ish. I was the 6th in line and there were like 18 ppl in total approximately. However I had to wait for 35mins in line to buy it. It is $10cad for a whole cake which the size of the cake is not that big. Only allow one customer per cake. I do recommend try to go after the rush hours and not to go during winter condition with extreme cold weather e.g -10 and below because you might end up lining up outside unless you don't feel cold.  The cake taste not so sweet which is perfect for people like doesn't like extreme sweet taste. I can taste the cheese within the cake. It is better to eat it fresh and the cake of the portion can serve 2 to 3 people max depends how hungry you are. "},
{"date": "\n        2/5/2018\n    ", "rating": "4.0 star rating", "review": "I'm not much of a cheesecake person but I really enjoy Uncle Tetsu's. Personally I prefer the lighter taste and feel of Japanese cheesecake vs the heavier, New York style one. The cake is fluffy and falls apart in your mouth upon first forkful - it's very delicate. The sugar also feels lighter and not as dense."},
{"date": "\n        2/4/2018\n    ", "rating": "5.0 star rating", "review": "I got two cheesecakes but had to line up twice (One cheesecake per person). I went on a Friday around 7 PM and found little to no line up. Line moves pretty quickly. The store literally felt like a sauna!"},
{"date": "\n        2/4/2018\n    ", "rating": "4.0 star rating", "review": "Favorite cheesecake place in Toronto! The cake is fluffy and melts in your mouth. I highly recommend you to eat it the same day or else it won't taste as great when you microwave it a few days later."},
{"date": "\n        1/25/2018\n    ", "rating": "5.0 star rating", "review": "I've seen buzzfeed and tasty videos on this jiggly and fluffy cheesecake and I knew I HAD to try it while I was in Toronto. "},
{"date": "\n        1/21/2018\n    ", "rating": "5.0 star rating", "review": "Long overdue, but finally gave Uncle Tetsu's a try! Their freshly baked Japanese cheesecake is like none other, with a unique light, spongy, airy texture and just the right amount of cheesiness that instantly melts in your mouth. I can see why there is always a long lineup at their store... it's so good and not overtly dense that I even snuck another slice as my breakfast!"},
{"date": "\n        1/3/2018\n    ", "rating": "4.0 star rating", "review": "Another must-stop for me was Uncle Tetsu's Cheesecake. I had missed it when I went to Osaka last February, so I was pretty set on trying it here. In case you've never heard of it, you should really google it! It's a Japanese, jiggly and fluffy cheesecake! Really aesthetic and light and creamy."},
{"date": "\n        1/2/2018\n    ", "rating": "5.0 star rating", "review": "This place is a tiny factory! There is always a lineup to get it, and they make delicious Cheesecakes for $10 (real inexpensive for quality). Did I mention very delicious? It's really best eaten warm (some like it cold) and will melt in your mouth! They also have delicious Honey Madeleine and tarts! Must try!"},
{"date": "\n        12/15/2017\n    ", "rating": "4.0 star rating", "review": "Amazing cheesecake, I really enjoyed the matcha one. "},
{"date": "\n        12/10/2017\n    ", "rating": "2.0 star rating", "review": "I got the original cheesecake and tried it when it was still warm. Didn't like it at all. It is so soft and puffy but in terms of the taste , it was like an omelette with lot of eggs with a little bit sugar.... seriously the egg flavor dominates... very moderate! I don't know why there is always a line-up. I had to wait for 40 minutes too. When I put it in fridge and tried it when it got cold, tasted better! It was first and last time..."},
{"date": "\n        11/30/2017\n    ", "rating": "5.0 star rating", "review": "Best cheesecake I have ever had! The imitations are good, but not as good as Uncle Tetsu's. I visited Sunday morning right after they opened, and didn't encounter a line at all. They only sell the original cheesecake and madeleines at this location (when I visited). This is definitely a must-visit shop!"},
{"date": "\n        11/24/2017\n    ", "rating": "3.0 star rating", "review": "A very hard review to give, the cheesecakes themselves are exceptional and the price reflects that."},
{"date": "\n        11/21/2017\n    ", "rating": "4.0 star rating", "review": "Best Japanese cheesecake!! Long line ups, but so worth it! I recommend this place to anyone who is willing to try something new, you won't regret it!"},
{"date": "\n        11/17/2017\n    ", "rating": "4.0 star rating", "review": "I've tried Uncle Tetsu's cheesecake only once, but I became a fan of this dessert right away. There is a hype about this for a reason. It is a bit pricey, but the unique taste of the cheesecake and packaging is too cute to resist. "}
]