[
{"date": "17 March 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "So worth the line ups..Definitely worth trying while in downtown Toronto ..$10 for a whole cake...❤️"},
{"date": "11 March 2018", "rating": "ui_bubble_rating bubble_20", "title": null, "review": "Finally stumbled upon this place that has so much hype. We bought the ten dollar cheesecake but while it was light and fluffy, we thought that it was basically tasteless egg whites. We wouldn't purchase it again."},
{"date": "8 March 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Semisweet plain cheesecake\nNever tried this before\nVery soft and fresh\nWould love to try cheesecake tarts next time"},
{"date": "26 February 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Only recently have I been to Uncle Tetsu's as usually the lines to get a cheesecake were way too ridiculous. However, by a stroke of some luck I have been able to really enjoy their delicious cheesecakes and honey Madeline's. I believe the packaging, even..."},
{"date": "22 February 2018", "rating": "ui_bubble_rating bubble_30", "title": null, "review": "Finally had the chance to swing by this place. Yes, I know... I'm VERY behind in the trends. But being someone who is not a huge fan of desserts to begin with, it wasn't high on my priorities list.\nUnfortunately, I'm just not sure what..."},
{"date": "25 January 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "It used to be super busy but now it has died down. I always get the regular cheesecake $10. Now there are two locations downtown and one in Pacific mall. So it is easier accessible. So fluffy highly recommend! Definitely worth the money vs Pablo."},
{"date": "19 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "I was advised that a visit to Uncle Tetsu’s was a must for a cheesecake lover, but that I needed to be ready to wait in line for a long time. Well my timing must have been perfect because there was no line at all!..."},
{"date": "9 January 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Located next to the Bus Terminal in downtown Toronto, it is very common to see Bus passengers carrying Uncle Tetsu bags. Line ups are very common as the store is very small. That being said, the cheesecake (which is $10) is light, fluffy, and delicious...."},
{"date": "3 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Yes, you have to wait in line for a cheesecake, but it is SO worth it. The light delicate flavor of the Japanese cheesecake is worth $10. After I waited in line for 10 minutes, I went into the adjacent space for cheese tarts. OMG..."},
{"date": "27 December 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Have wanted to here ever since I saw a line up around block on a visit to Toronto a couple of years ago and hearing about their soufflé-like cheesecakes. We happened to pass by when the line was just a few people out the door...."}
]