[
{"date": "\n        3/19/2018\n    ", "rating": "4.0 star rating", "review": "Been here many, many times over the years and love the energy, atmosphere and consistent high quality food. This is a great place to take friends and family, for casual or special occasions. I especially like that they play traditional Japanese music in the bathroom and have brought my grandparents here for lunch so that they could experience that as well. The restaurant is a lot quieter during lunch. It can get pretty loud for dinner. "},
{"date": "\n        3/16/2018\n    ", "rating": "3.0 star rating", "review": "Tastes good, but kind of expensive."},
{"date": "\n        3/13/2018\n    ", "rating": "5.0 star rating", "review": "Came here for my birthday. Party of 8, able to reserve on and alter reservation easily on yelp. I reserved for a Friday 2 days before and altered amount of ppl and time of arrival the night before. Glad I made a reservation as there was a constant crowd of ppl waiting for tables. "},
{"date": "\n        3/9/2018\n    ", "rating": "5.0 star rating", "review": "I can't believe I have not reviewed this place yet. It's unique among the small choices for Toronto Izakaya, but the staff KNOW what they are doing. Service and food is consistently high quality and memorable. I can't recall ever ordering anything on their menu that I didn't like, probably because it's so fresh! They make some great cocktails, too."},
{"date": "\n        3/7/2018\n    ", "rating": "1.0 star rating", "review": "Food was mediocre.... "},
{"date": "\n        3/3/2018\n    ", "rating": "4.0 star rating", "review": "This place is unique compared to other Japanese restaurants. It gives me a really welcoming and excited vibe. The food was delicious and there were many different choices of alcoholic beverages. Some of the drinks look absolutely gorgeous. "},
{"date": "\n        2/18/2018\n    ", "rating": "4.0 star rating", "review": "Their servers are very passionate and enthusiastic  I would recommend the drink called \" sake boom\" there, you would definitely get a awesome experience if you are the first time. Their food are pretty good, too. Their set menu is worth to try if you are the first time there. Anyway, worth it to try out."},
{"date": "\n        1/29/2018\n    ", "rating": "5.0 star rating", "review": "What a nice & fun restaurant, I had fun. The food is yummy, the drinks are yummy and the service is really good, I would go back :)"},
{"date": "\n        1/26/2018\n    ", "rating": "4.0 star rating", "review": "I like this restaurant, good food, nice atmosphere except needs lots of improvement in ventilation. You WILL smell like a dish when you finish your meal and need a thorough head to toe cleansing to get the food aroma off yourself!"},
{"date": "\n        1/18/2018\n    ", "rating": "4.0 star rating", "review": "The food was amazing here, got the 7 course meal deal for $29 each person. All the meals were really well portion. The place is loud, really lively and great atmosphere. It tends to get really busy in the evenings so having reservations is a must. Would definitely come back again to try their other set course meals!"},
{"date": "\n        1/1/2018\n    ", "rating": "2.0 star rating", "review": "This latest addition has relative poor service compared to the Church and Bathurst Location which have stellar service.   At the new Yonge and Sheppard Location, the service is not coordinated, and sloppy likely because the servers are not exclusively Working Holiday Visa staff from Japan, but instead a mix of indifferent"},
{"date": "\n        1/1/2018\n    ", "rating": "1.0 star rating", "review": "Poor quality food, I have been there twice, upsetting food experience both times - real disgrace to Japanese food...  Cool hang out though if you are not there for the food.  I remember visiting the original Kinka and it was a much better experience.  This location is destroy the restaurant brand..."},
{"date": "\n        1/1/2018\n    ", "rating": "3.0 star rating", "review": "Overall great restaurant "},
{"date": "\n        12/31/2017\n    ", "rating": "5.0 star rating", "review": "Love this place! The staff are amazing, vibrant and friendly! The food is delectable, not too salty. Good portion sizes. The ambience is cheery. The theme is wood-inspired. Love the karaage, karubi, baked oysters, bibimbap, tontoro, butabara, ramen and brie cheese. Paid $250 for 8 people (minus the drinks). Sake bomb!"},
{"date": "\n        12/25/2017\n    ", "rating": "5.0 star rating", "review": "Have been to this restaurant at least 5 times in the past year and each experience is always great. Service is amazing, love the ambiance and the food is always so good. If you love Japanese food and tapas this place is for you. Baked oysters are recommended if you are stuck on the delicious menu!"},
{"date": "\n        12/15/2017\n    ", "rating": "5.0 star rating", "review": "I really liked the food I got here.  I got the kinoko bibimbap and am still craving more. My only wish is that  the serving portion would be larger. Love the way the servers greet customers by yelling in japanese ;, their enthusiasm is non- stop and contagious because I ended up yelling too somehow even though I don't know the language. I'll definitely be comimg back with more ppl"},
{"date": "\n        11/30/2017\n    ", "rating": "5.0 star rating", "review": "I didn't want to spoil my review, but I totally love this place! I went with a group for lunch so we ordered quite a few things to share."},
{"date": "\n        11/26/2017\n    ", "rating": "4.0 star rating", "review": "Came here on a weekday and it was still fairly busy so i would definitely recommend reserving seats. The location is amazing as it is right out Yonge and Sheppard subway station and perfect for midtown uptown folks."},
{"date": "\n        11/25/2017\n    ", "rating": "4.0 star rating", "review": "Always a good spot to eat yummy jap food! Consistent good quality and tasting food! Love the patio when its summer time! Almond tofu is a must get at the end of your meal !"},
{"date": "\n        11/18/2017\n    ", "rating": "4.0 star rating", "review": "We ordered for eight people, everything was great until we started wondering about our udon. After asking the staff to follow up twice, the three bowls of noodles finally arrived. We were not pleased because the udon were 42 minutes apart from the first dish that arrived. Although the staff didn't do anything about it, after complaining to the manager, she offered to remove the items from our bill. She even went the extra mile to offer free desserts and brought us a big pot of green tea. We really appreciate the great service; however, 42 minutes is a serious problem because imagine there's only the two of you, your food arrives, your friend's food arrives 42 minutes later...."}
]