[
{"date": "20 March 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "This place serves great food for a good price and its not super over priced its a great taco place to visit in the market"},
{"date": "17 March 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Every time I come to Toronto, I try to stop in at Seven Lives to get their Gobernador tacos. I was a bit surprised that they have updated some of their menu (e.g., they used to put smoked tuna in these tacos), but they were..."},
{"date": "21 February 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Their tacos are great, a bit pricey - $6 + tax per taco but i will say quality over quantity never goes wrong.\nMy fav is their grilled chicken one and the fish fillet... they pack a punch of flavour!\nThey also make some fresh..."},
{"date": "29 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Very good but very crowded, long line ups and often certain ingredients are sold out. The seafood options are really good. Never tried the vegetarian but it was very popular."},
{"date": "12 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "These tacos were great!! We got the Baja Fish taco, Adobada taco (pork and pineapple), Gobernador (marlin, shrimp and cheese) and the pollo asado (spicy grilled chicken). All four were delicious! The fried fish was was nice and crunchy, all the toppings and meat were..."},
{"date": "3 January 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Yeah I went here to grab a snack and boy the line was hella packed had to wait bout 20 mins before I got served but it was worth it! I love this place"},
{"date": "20 December 2017", "rating": "ui_bubble_rating bubble_20", "title": null, "review": "I was excited to see octopus tacos on the menu but was disappointed with the result. The octopus was tough and tortilla was sub-par. Cool little spot but better places to eat elsewhere"},
{"date": "25 November 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Great options, we went with the Baja fish and the spicy shrimp. Long wait but worth it. Milder than expected flavour but still enjoyed it. Would definitely go back."},
{"date": "16 November 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Great tacos! Fish, Shrimp and Chicken is good. Their guacamole is the Best in town. And their sodas are great too."},
{"date": "10 November 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Cash only!! Wow. An amazing place with lots of great seafood selection. And the beef and pork were also amazing but the highlight is definitely their seafood array. It's worth the trip."}
]