//TRIPADVISOR:
[
{"date": "21 February 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Their tacos are great, a bit pricey - $6 + tax per taco but i will say quality over quantity never goes wrong.\nMy fav is their grilled chicken one and the fish fillet... they pack a punch of flavour!\nThey also make some fresh..."},
{"date": "29 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Very good but very crowded, long line ups and often certain ingredients are sold out. The seafood options are really good. Never tried the vegetarian but it was very popular."},
{"date": "12 January 2018", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "These tacos were great!! We got the Baja Fish taco, Adobada taco (pork and pineapple), Gobernador (marlin, shrimp and cheese) and the pollo asado (spicy grilled chicken). All four were delicious! The fried fish was was nice and crunchy, all the toppings and meat were..."},
{"date": "3 January 2018", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Yeah I went here to grab a snack and boy the line was hella packed had to wait bout 20 mins before I got served but it was worth it! I love this place"},
{"date": "20 December 2017", "rating": "ui_bubble_rating bubble_20", "title": null, "review": "I was excited to see octopus tacos on the menu but was disappointed with the result. The octopus was tough and tortilla was sub-par. Cool little spot but better places to eat elsewhere"},
{"date": "25 November 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Great options, we went with the Baja fish and the spicy shrimp. Long wait but worth it. Milder than expected flavour but still enjoyed it. Would definitely go back."},
{"date": "16 November 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Great tacos! Fish, Shrimp and Chicken is good. Their guacamole is the Best in town. And their sodas are great too."},
{"date": "10 November 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "Cash only!! Wow. An amazing place with lots of great seafood selection. And the beef and pork were also amazing but the highlight is definitely their seafood array. It's worth the trip."},
{"date": "5 October 2017", "rating": "ui_bubble_rating bubble_40", "title": null, "review": "Let's start with the fact that the tacos are $6. As a snobby Californian, that's a lot to pay for a taco, even accounting for the exchange rate.\nFor $6, though, you do get a pretty good taco. We got the Gobernator, which came out..."},
{"date": "1 October 2017", "rating": "ui_bubble_rating bubble_50", "title": null, "review": "There are always lineups here and they only take cash. However long you have to wait, wait, because it's really good :) We came here for part of our lunch, wanting to enjoy other places in Kensington Market as well. Had the spicy pork and..."}
]

//YELP:
[
{"date": "\n        3/3/2018\n    ", "rating": "4.0 star rating", "review": "The offering at Sushi Bong can be summed up in a few words: fresh fish, low prices, minimum services, mostly for take out and minimum seating.  "},
{"date": "\n        2/25/2018\n    ", "rating": "1.0 star rating", "review": "Worst sushi I have ever had. First of all, the rice is very blant. There's no hint of vinegary or sweetness in it. I ordered a sweet potato roll and red dragon roll, and they gave me a chewy salmon that tasted like it's not supposed to be use for any sushi but for cooking instead, also the tempura shrimp inside the red dragon roll is stale as it can be. The rolls tasted very old all in all, though they give you bigs rolls, because Korean sushi rolls are usually massive. I would never in my life try this place again. It's not cheap at all like other reviewers in yelp says so. Very very disappointed. I suggest you make your own sushi at home instead."},
{"date": "\n        1/7/2018\n    ", "rating": "5.0 star rating", "review": "Portions are huge and fish seems very fresh! I always crave this place whenever I want to eat some really good and decently priced sushi. There are two locations on Yonge but I like this one better since it is not as crowded as the other one and it is easier to find parking here. This place is generally for take out, but there are a few tables if you are planning on dining in. Orders don't take long either, if you're ordering take out it is usually ready between 10-15 mins. This time we got the small party combo and spicy salmon roll but we also like to get the sushi bong special. I especially like this place because they don't cheap out on ingredients and they also don't include a lot of rice with the sushi or rolls. Although it is a bit far, I would definitely keep coming back here."},
{"date": "\n        12/31/2017\n    ", "rating": "5.0 star rating", "review": "Reasonable price... big portion, good taste and fresh.  This place is going to be my number one choice for takeout or even quick eat-in for a sushi fix..."},
{"date": "\n        11/30/2017\n    ", "rating": "4.0 star rating", "review": "If you're looking to squash a sushi craving fast, look no further. Sushi Bong is a very economical  Korean owned sushi shop that pumps out rolls like nobody's business. Yes, there are fancier and higher grade sushi shops out there, but for your dollar, these guys will do the trick. Their sushi bong special is always a good choice. For roughly $10 and change, you get 8 jumbo sized rolls that are basically california rolls but with salmon added, 4 salmon rolls, and 5 nice juicy slabs of assorted sushi. That's a lot of fresh fish for $10! Very filling, this special can be shared by 2. You definitely will get high off sushi from eating here; pun intended."},
{"date": "\n        11/29/2017\n    ", "rating": "4.0 star rating", "review": "I prefer this Sushi Bong over the original location. +1 star for the parking lot and location- much more spacious and less hectic. They take only cash/ debit and I'm so glad they don't charge a fee to use debit. The original location charges me a fee every single time I use debit! "},
{"date": "\n        11/15/2017\n    ", "rating": "5.0 star rating", "review": "I recently went here and got the special for $12. THE PORTIONS WERE HUGE! It was a great value for all the sushi you're getting, I highly recommend this place if you're ordering takeout sushi. Not so much for dine in because there is limited seating, but other than that it's a great place to get high quality sushi for cheap in North York! ^_^"},
{"date": "\n        11/4/2017\n    ", "rating": "2.0 star rating", "review": "Ya not a whole lot to say except this place is a one and done for me."},
{"date": "\n        10/29/2017\n    ", "rating": "5.0 star rating", "review": "Still by far my #1 sushi takeout spot!!! Awesome, delicious food at super cheap prices :D Love how their rolls are huge, and not because there's a ton of rice but because they're stuffed with ingredients. The fish on top of the sushi and sashimi are not thinly cut either!"},
{"date": "\n        10/26/2017\n    ", "rating": "4.0 star rating", "review": "Quick grab and go sushi. The sushis good portion too! Be careful on placing take out orders there are two locations closed by make sure you are on the right spot."},
{"date": "\n        10/22/2017\n    ", "rating": "3.0 star rating", "review": "Like the Yonge and Finch location, this location is also primarily meant as a take out restaurant, with very limited seating inside (I think there was only 2 tables). The price here is very cheap, and the quantity is good, however the quality of the rolls and fish is just average. For the chirashi bowl, the variety of fish provided is very average (there was the usual tuna, salmon, crab meat, etc. nothing fancy)."},
{"date": "\n        10/19/2017\n    ", "rating": "3.0 star rating", "review": "This was my first time to Sushi Bong despite hearing all about their delicious sushi rolls.  Their original location is at Yonge and Finch.  This location in Thornhill is their second location.  It's located where the World on Yonge Complex is (also where the original Love Me Sweet is)."},
{"date": "\n        10/4/2017\n    ", "rating": "5.0 star rating", "review": "This is the best sushi that Canada can offer nothing can beat it. excellent quality for a good and affordable price"},
{"date": "\n        9/20/2017\n    ", "rating": "5.0 star rating", "review": "Located in World On Yonge plaza."},
{"date": "\n        9/10/2017\n    ", "rating": "5.0 star rating", "review": "This is definitely my go spot whenever I crave sushi. Sashimi tastes fresh, rolls are huge, filling, and tasty, and service is extremely fast and friendly. You've got your basic maki rolls (eg spicy salmon) and special rolls (I  would recommended dynamite, unagi, red/green dragon roll, or anything else on the menu!!). We always order a platter of sashimi to accompany the rolls. What's awesome is that they have different sizes to accommodate the number of people dining and even a small is A LOT. "},
{"date": "\n        8/21/2017\n    ", "rating": "5.0 star rating", "review": "This Sushi Bong is an offshoot of the highly successful location at Yonge/Finch. This location features much more seating for eat-in customers, newer decor, and more parking compared to its older sibling. The highlight of Sushi Bong are its generous portions of sushi at really cheap prices. One order of dynamite rolls ($6.99), which are gigantic, is enough for my dinner. My default order is their Sushi Bong Special (~$11), which features California rolls (which can be subbed for other rolls if you're willing to pay extra), sushi, and nigiri. Service is quick and friendly, with orders being ready as soon as 3 minutes after the initial call. All in all, Sushi Bong is a great spot for anyone that wants sushi takeout in the area."},
{"date": "\n        8/3/2017\n    ", "rating": "3.0 star rating", "review": "Came here for the first time, would give 3.5."},
{"date": "\n        8/2/2017\n    ", "rating": "4.0 star rating", "review": "Got takeout from here on a Saturday, around 7:15 pm. I was not in a rush and closeby, so wanted to see how fast they made the sushi by ordering on the spot. Got the Sushi Bong's Special and it was done in less than 5 mins. The location is mainly a takeout place, with room for 3 or so pairs (there was 1 sitting down at the time, with other tables all holding takeout). Parking was not a challenge and I managed to find a spot on the surface level. "},
{"date": "\n        7/30/2017\n    ", "rating": "3.0 star rating", "review": "The portions here are great. If you're feeling rolls, this is where to come. You'd definitely be satisfied with a single roll order, and could probably split one roll between two people if you're just looking for a snack or a light meal. This place is definitely more of a takeout place, because there's only one /actual/ table. The service is poor, with dismissive and short workers, but the food itself makes me want to come back. The rolls are a bit on the pricey side, but worth it considering the quantity."},
{"date": "\n        7/27/2017\n    ", "rating": "3.0 star rating", "review": "First Impressions"}
]

//GOOGLE MAPS: 
[  
   {  
      "id":"ChIJgwUJWG0tK4gR3V2HPKc6u8c",
      "name":"Sushi Bong",
      "address":"5 Northtown Way, North York, ON M2N 7A1, Canada",
      "searchterm":"Sushi Bong 5 Northtown Way, North York, ON M2N 7A1, Canada",
      "types":[  
         "restaurant",
         "food",
         "point_of_interest",
         "establishment"
      ],
      "coordinates":{  
         "lat":43.77516499999999,
         "lng":-79.413705
      },
      "rating":4.3,
      "rating_n":391,
      "international_phone_number":"+1 416-227-0022",
      "populartimes":[  
         {  
            "name":"Monday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               25,
               32,
               28,
               25,
               30,
               48,
               66,
               71,
               58,
               39,
               19,
               0
            ]
         },
         {  
            "name":"Tuesday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               12,
               19,
               23,
               19,
               16,
               25,
               39,
               48,
               42,
               28,
               16,
               0
            ]
         },
         {  
            "name":"Wednesday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               26,
               32,
               21,
               17,
               26,
               41,
               55,
               57,
               50,
               35,
               19,
               0
            ]
         },
         {  
            "name":"Thursday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               64,
               57,
               5,
               7,
               17,
               35,
               53,
               62,
               57,
               39,
               21,
               0
            ]
         },
         {  
            "name":"Friday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               28,
               30,
               19,
               14,
               17,
               30,
               42,
               51,
               53,
               46,
               33,
               0
            ]
         },
         {  
            "name":"Saturday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               17,
               51,
               53,
               26,
               30,
               62,
               94,
               100,
               76,
               48,
               28,
               0
            ]
         },
         {  
            "name":"Sunday",
            "data":[  
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               0,
               30,
               48,
               66,
               75,
               69,
               55,
               35,
               19,
               0
            ]
         }
      ]
   }
]